<?php
	header("Access-Control-Allow-Origin: *");
	header("Access-Control-Allow-Methods:POST,GET");
	header("Access-Control-Allow-Headers:x-requested-with,content-type");
	header("Content-type:text/json;charset=utf-8");
	
	$pageindex = $_GET['pageindex'];
	
	// $artid = $_GET['artid'];
	$arr = [];
	$arr[0] = [
		"id" => 1,
		"user_name" => "赵",
		"add_time" => "2019/10/20 07:12",
		"content" => "中共中央总书记、国家主席、中央军委主席习近平18日在武汉分别接见了联勤保障部队第一次党代表大会全体代表、驻湖北部队副师职以上领导干部和团级单位主官。"
	];
	$arr[1] = [
		"id" => 2,
		"user_name" => "钱",
		"add_time" => "2019/10/20 07:32",
		"content" => "首届跨国公司领导人青岛峰会19日在山东青岛召开，国家主席习近平致贺信。"
	];
	$arr[2] = [
		"id" => 3,
		"user_name" => "孙",
		"add_time" => "2019/10/20 07:42",
		"content" => "10月19日早上，2019世界VR产业大会在南昌开幕。中共中央政治局委员、国务院副总理刘鹤出席并发表讲话。"
	];
	$arr[3] = [
		"id" => 4,
		"user_name" => "李",
		"add_time" => "2019/10/20 07:52",
		"content" => "国家统计局今天公布三季度主要经济数据，从GDP增速来看，前三季度同比增长6.2%，其中三季度增长6.0%，尽管和上半年相比有所放缓，但仍处于宏观调控的目标区间之内。"
	];
	$arr[4] = [
		"id" => 5,
		"user_name" => "周",
		"add_time" => "2019/10/20 07:58",
		"content" => "据美国《新闻周刊》网站10月17日报道称，自特朗普总统日前宣布两国将很快签署初步协议以来，美中达成的“第一阶段”贸易协议所带来的希望一直起伏不定。"
	];
	$arr[5] = [
		"id" => 6,
		"user_name" => "吴",
		"add_time" => "2019/10/20 7:49",
		"content" => "据最新数据显示，在大量归国就业的留学人员中，理工科专业海归薪资普遍高于商科等专业，技术研发类人才最受雇主青睐，而新一线城市对海归就业人员的吸引力“直逼”北上广深。",
	];
	$arr[6] = [
		"id" => 7,
		"user_name" => "郑",
		"add_time" => "2019/10/20 7:49",
		"content" => "据最新数据显示，在大量归国就业的留学人员中，理工科专业海归薪资普遍高于商科等专业，技术研发类人才最受雇主青睐，而新一线城市对海归就业人员的吸引力“直逼”北上广深。",
	];
	$arr[7] = [
		"id" => 8,
		"user_name" => "王",
		"add_time" => "2019/10/20 7:49",
		"content" => "据最新数据显示，在大量归国就业的留学人员中，理工科专业海归薪资普遍高于商科等专业，技术研发类人才最受雇主青睐，而新一线城市对海归就业人员的吸引力“直逼”北上广深。",
	];
	$arr[8] = [
		"id" => 9,
		"user_name" => "冯",
		"add_time" => "2019/10/20 7:49",
		"content" => "据最新数据显示，在大量归国就业的留学人员中，理工科专业海归薪资普遍高于商科等专业，技术研发类人才最受雇主青睐，而新一线城市对海归就业人员的吸引力“直逼”北上广深。",
	];
	$arr[9] = [
		"id" => 10,
		"user_name" => "陈",
		"add_time" => "2019/10/20 7:49",
		"content" => "据最新数据显示，在大量归国就业的留学人员中，理工科专业海归薪资普遍高于商科等专业，技术研发类人才最受雇主青睐，而新一线城市对海归就业人员的吸引力“直逼”北上广深。",
	];
	$arr[10] = [
		"id" => 11,
		"user_name" => "褚",
		"add_time" => "2019/10/20 7:49",
		"content" => "据最新数据显示，在大量归国就业的留学人员中，理工科专业海归薪资普遍高于商科等专业，技术研发类人才最受雇主青睐，而新一线城市对海归就业人员的吸引力“直逼”北上广深。",
	];
	$arr[11] = [
		"id" => 12,
		"user_name" => "卫",
		"add_time" => "2019/10/20 7:49",
		"content" => "据最新数据显示，在大量归国就业的留学人员中，理工科专业海归薪资普遍高于商科等专业，技术研发类人才最受雇主青睐，而新一线城市对海归就业人员的吸引力“直逼”北上广深。",
	];
	$arr[12] = [
		"id" => 13,
		"user_name" => "蒋",
		"add_time" => "2019/10/20 7:49",
		"content" => "据最新数据显示，在大量归国就业的留学人员中，理工科专业海归薪资普遍高于商科等专业，技术研发类人才最受雇主青睐，而新一线城市对海归就业人员的吸引力“直逼”北上广深。",
	];
	$arr[13] = [
		"id" => 14,
		"user_name" => "沈",
		"add_time" => "2019/10/20 7:49",
		"content" => "据最新数据显示，在大量归国就业的留学人员中，理工科专业海归薪资普遍高于商科等专业，技术研发类人才最受雇主青睐，而新一线城市对海归就业人员的吸引力“直逼”北上广深。",
	];
	$arr[14] = [
		"id" => 15,
		"user_name" => "韩",
		"add_time" => "2019/10/20 7:49",
		"content" => "据最新数据显示，在大量归国就业的留学人员中，理工科专业海归薪资普遍高于商科等专业，技术研发类人才最受雇主青睐，而新一线城市对海归就业人员的吸引力“直逼”北上广深。",
	];
	$arr[15] = [
		"id" => 16,
		"user_name" => "杨",
		"add_time" => "2019/10/20 7:49",
		"content" => "据最新数据显示，在大量归国就业的留学人员中，理工科专业海归薪资普遍高于商科等专业，技术研发类人才最受雇主青睐，而新一线城市对海归就业人员的吸引力“直逼”北上广深。",
	];
	$arr = array_slice($arr, 0, (5 * $pageindex));
    $newslist = json_encode($arr);
	echo $newslist;

?>